IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28003x_mem_cfg_regs.xml
	<register id="GSxLOCK" width="32" page="1" offset="0x40" internal="0" description="Global Shared RAM Config Lock Register">
		<bitfield id="LOCK_GS0" description="GS0 RAM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS1" description="GS1 RAM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS2" description="GS2 RAM Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS3" description="GS3 RAM Lock bits" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxCOMMIT" width="32" page="1" offset="0x42" internal="0" description="Global Shared RAM Config Lock Commit Register">
		<bitfield id="COMMIT_GS0" description="GS0 RAM Permanent Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS1" description="GS1 RAM Permanent Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS2" description="GS2 RAM Permanent Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS3" description="GS3 RAM Permanent Lock bits" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxACCPROT0" width="32" page="1" offset="0x48" internal="0" description="Global Shared RAM Config Register 0">
		<bitfield id="FETCHPROT_GS0" description="Fetch Protection For GS0 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS0" description="CPU WR Protection For GS0 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS0" description="DMA WR Protection For GS0 RAM" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="HICWRPROT_GS0" description="HIC WR Protection For GS0 RAM" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS1" description="Fetch Protection For GS1 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS1" description="CPU WR Protection For GS1 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS1" description="DMA WR Protection For GS1 RAM" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="HICWRPROT_GS1" description="HIC WR Protection For GS0 RAM" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS2" description="Fetch Protection For GS2 RAM" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS2" description="CPU WR Protection For GS2 RAM" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS2" description="DMA WR Protection For GS2 RAM" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="HICWRPROT_GS2" description="HIC WR Protection For GS0 RAM" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS3" description="Fetch Protection For GS3 RAM" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS3" description="CPU WR Protection For GS3 RAM" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS3" description="DMA WR Protection For GS3 RAM" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="HICWRPROT_GS3" description="HIC WR Protection For GS0 RAM" begin="27" end="27" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxTEST" width="32" page="1" offset="0x50" internal="0" description="Global Shared RAM TEST Register">
		<bitfield id="TEST_GS0" description="Selects the different modes for GS0 RAM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS1" description="Selects the different modes for GS1 RAM" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS2" description="Selects the different modes for GS2 RAM" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS3" description="Selects the different modes for GS3 RAM" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="GSxINIT" width="32" page="1" offset="0x52" internal="0" description="Global Shared RAM Init Register">
		<bitfield id="INIT_GS0" description="RAM Initialization control for GS0 RAM." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS1" description="RAM Initialization control for GS1 RAM." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS2" description="RAM Initialization control for GS2 RAM." begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS3" description="RAM Initialization control for GS3 RAM." begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxINITDONE" width="32" page="1" offset="0x54" internal="0" description="Global Shared RAM InitDone Status Register">
		<bitfield id="INITDONE_GS0" description="RAM Initialization status for GS0 RAM." begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS1" description="RAM Initialization status for GS1 RAM." begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS2" description="RAM Initialization status for GS2 RAM." begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS3" description="RAM Initialization status for GS3 RAM." begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="GSxRAMTEST_LOCK" width="32" page="1" offset="0x56" internal="0" description="Lock register to GSx RAM TEST registers">
		<bitfield id="GS0" description="GSxTEST.TEST_GS0 LOCK" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GS1" description="GSxTEST.TEST_GS1 LOCK" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GS2" description="GSxTEST.TEST_GS2 LOCK" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GS3" description="GSxTEST.TEST_GS3 LOCK" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to enable write to lock" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MSGxLOCK" width="32" page="1" offset="0x60" internal="0" description="Message RAM Config Lock Register">
		<bitfield id="LOCK_CPUTOCLA1" description="CPUTOCLA1 RAM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CLA1TOCPU" description="CLA1TOCPU RAM Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CLA1TODMA" description="CLA1TODMA RAM control fields lock bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_DMATOCLA1" description="DMATOCLA1 RAM control fields lock bit" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="MSGxCOMMIT" width="32" page="1" offset="0x62" internal="0" description="Message RAM Config Lock Commit Register">
		<bitfield id="COMMIT_CPUTOCLA1" description="CPUTOCLA1 RAM control fields COMMIT bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_CLA1TOCPU" description="CLA1TOCPU RAM control fields COMMIT bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_CLA1TODMA" description="CLA1TODMA RAM control fields COMMIT bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_DMATOCLA1" description="DMATOCLA1 RAM control fields COMMIT bit" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="MSGxTEST" width="32" page="1" offset="0x70" internal="0" description="Message RAM TEST Register">
		<bitfield id="TEST_CPUTOCLA1" description="CPU to CLA1 MSG RAM Mode Select" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="TEST_CLA1TOCPU" description="CLA1 to CPU MSG RAM Mode Select" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="TEST_CLA1TODMA" description="CLA1 to DMA MSG RAM Mode Select" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="TEST_DMATOCLA1" description="DMA to CLA1 MSG RAM Mode Select" begin="13" end="12" width="2" rwaccess="RW"/>
	</register>
